Certification/src/Catalogs/ВидыРабот/ВидыРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРабот</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнойПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляТабеля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатья</name>
    <type>
      <types>CatalogRef.СтатьиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>EnumRef.ВидыРабот</types>
    </type>
  </attributes>
</mdclass:Catalog>

Certification/src/Catalogs/ВидыРабот/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	//Проверить справочник Работы. Если в нем нет ни одной работы, ссылающийся на этот вид работ, создаем ее.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Работы.Ссылка
		|ИЗ
		|	Справочник.Работы КАК Работы
		|ГДЕ
		|	Работы.ВидыРабот = &Ссылка
		|	И НЕ Работы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		СпрРабота = Справочники.Работы.СоздатьЭлемент();
		СпрРабота.Наименование = Ссылка.Наименование;
		СпрРабота.ВидРаботы = Ссылка.ВидРаботы;
		СпрРабота.ДляТабеля = Ссылка.ДляТабеля;
		СпрРабота.ОсновнаяСтатья = Ссылка.ОсновнаяСтатья;
		СпрРабота.ОсновнойПроект = Ссылка.ОсновнойПроект;
		СпрРабота.ПолноеНаименование = Ссылка.ПолноеНаименование;
		СпрРабота.ВидыРабот = Ссылка;
		СпрРабота.Записать();
	КонецЕсли;

КонецПроцедуры
